; domain
;; logistics domain Typed version.
;;

(define (domain logistics)
  (:requirements :strips :typing) 
  (:types truck
          airplane - vehicle
          package
          vehicle - physobj
          airport
          location - place
          city
          place 
          physobj - object)
  
  (:predicates 	(in-city ?loc - place ?city - city)
		(at ?obj - physobj ?loc - place)
		(in ?pkg - package ?veh - vehicle)
		(city ?city - city))
  
(:action LOAD-TRUCK
   :parameters    (?pkg - package ?truck - truck ?loc - place)
   :precondition  (and (at ?truck ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?truck)))

(:action LOAD-AIRPLANE
  :parameters   (?pkg - package ?airplane - airplane ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?airplane)))

(:action UNLOAD-TRUCK
  :parameters   (?pkg - package ?truck - truck ?loc - place)
  :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
  :effect       (and (not (in ?pkg ?truck)) (at ?pkg ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters    (?pkg - package ?airplane - airplane ?loc - place)
  :precondition  (and (in ?pkg ?airplane) (at ?airplane ?loc))
  :effect        (and (not (in ?pkg ?airplane)) (at ?pkg ?loc)))

(:action DRIVE-TRUCK
  :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?truck ?loc-from) (not (at ?truck ?loc-to)) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
  :precondition
   (and (at ?airplane ?loc-from) (not (at ?airplane ?loc-to)))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

(:action wait
 :parameters ()
 :precondition (and)
 :effect (and)
)

)

; problem
(define (problem p01)
(:domain logistics)
(:objects
    plane1 - airplane
    pos1_1 pos2_1 pos3_1 pos4_1 - airport
    pos1_2 pos1_3 pos1_4   pos2_2 pos2_3   pos3_2 pos3_3   pos4_2 pos4_3 pos4_4 - location
    city1 city2 city3 city4 - city
    truck1 truck2 truck3 truck4 - truck
    pkg1 pkg2 pkg3 pkg4 pkg5 pkg6 - package
    background
)
(:init 
    (at plane1 pos2_1)
    (at truck1 pos1_1)
    (at truck2 pos2_1)
    (at truck3 pos3_1)
    (at truck4 pos4_1)
    (at pkg1 pos1_2)
    (at pkg2 pos1_2)
    (at pkg3 pos1_3)
    (at pkg4 pos1_3)
    (at pkg5 pos1_4)
    (at pkg6 pos1_4)
    (in-city pos1_1 city1)
    (in-city pos1_2 city1)
    (in-city pos1_3 city1)
    (in-city pos1_4 city1)
    (in-city pos2_1 city2)
    (in-city pos2_2 city2)
    (in-city pos2_3 city2)
    (in-city pos3_1 city3)
    (in-city pos3_2 city3)
    (in-city pos3_3 city3)
    (in-city pos4_1 city4)
    (in-city pos4_2 city4)
    (in-city pos4_3 city4)
    (in-city pos4_4 city4)
    (city city1)
    (city city2)
    (city city3)
    (city city4)
)
(:goal 
	(or 
	    (and (in pkg1 truck1) (in pkg3 truck1) (in pkg5 truck1))
		(and (in pkg2 truck1) (in pkg3 truck1) (in pkg5 truck1))
	    (and (in pkg1 truck1) (in pkg4 truck1) (in pkg5 truck1))
	    (and (in pkg2 truck1) (in pkg4 truck1) (in pkg5 truck1))
        (and (in pkg1 truck1) (in pkg3 truck1) (in pkg6 truck1))
		(and (in pkg2 truck1) (in pkg3 truck1) (in pkg6 truck1))
	    (and (in pkg1 truck1) (in pkg4 truck1) (in pkg6 truck1))
	    (and (in pkg2 truck1) (in pkg4 truck1) (in pkg6 truck1))
	    (and (in pkg1 truck2) (in pkg3 truck2) (in pkg5 truck2))
		(and (in pkg2 truck2) (in pkg3 truck2) (in pkg5 truck2))
	    (and (in pkg1 truck2) (in pkg4 truck2) (in pkg5 truck2))
	    (and (in pkg2 truck2) (in pkg4 truck2) (in pkg5 truck2))
        (and (in pkg1 truck2) (in pkg3 truck2) (in pkg6 truck2))
		(and (in pkg2 truck2) (in pkg3 truck2) (in pkg6 truck2))
	    (and (in pkg1 truck2) (in pkg4 truck2) (in pkg6 truck2))
	    (and (in pkg2 truck2) (in pkg4 truck2) (in pkg6 truck2))
	    (and (in pkg1 truck3) (in pkg3 truck3) (in pkg5 truck3))
		(and (in pkg2 truck3) (in pkg3 truck3) (in pkg5 truck3))
	    (and (in pkg1 truck3) (in pkg4 truck3) (in pkg5 truck3))
	    (and (in pkg2 truck3) (in pkg4 truck3) (in pkg5 truck3))
        (and (in pkg1 truck3) (in pkg3 truck3) (in pkg6 truck3))
		(and (in pkg2 truck3) (in pkg3 truck3) (in pkg6 truck3))
	    (and (in pkg1 truck3) (in pkg4 truck3) (in pkg6 truck3))
	    (and (in pkg2 truck3) (in pkg4 truck3) (in pkg6 truck3))
	    (and (in pkg1 truck4) (in pkg3 truck4) (in pkg5 truck4))
		(and (in pkg2 truck4) (in pkg3 truck4) (in pkg5 truck4))
	    (and (in pkg1 truck4) (in pkg4 truck4) (in pkg5 truck4))
	    (and (in pkg2 truck4) (in pkg4 truck4) (in pkg5 truck4))
        (and (in pkg1 truck4) (in pkg3 truck4) (in pkg6 truck4))
		(and (in pkg2 truck4) (in pkg3 truck4) (in pkg6 truck4))
	    (and (in pkg1 truck4) (in pkg4 truck4) (in pkg6 truck4))
	    (and (in pkg2 truck4) (in pkg4 truck4) (in pkg6 truck4))
	)
)
)

; plan
1. (drive-truck truck1 pos1_1 pos1_2 city1)
   deleted: (at truck1 pos1_1)
   added: (at truck1 pos1_2)
   goals met: 0 of 1
2. (load-truck pkg1 truck1 pos1_2)
   deleted: (at pkg1 pos1_2)
   added: (in pkg1 truck1)
   goals met: 0 of 1
3. (drive-truck truck1 pos1_2 pos1_4 city1)
   deleted: (at truck1 pos1_2)
   added: (at truck1 pos1_4)
   goals met: 0 of 1
4. (load-truck pkg5 truck1 pos1_4)
   deleted: (at pkg5 pos1_4)
   added: (in pkg5 truck1)
   goals met: 0 of 1
5. (drive-truck truck1 pos1_4 pos1_3 city1)
   deleted: (at truck1 pos1_4)
   added: (at truck1 pos1_3)
   goals met: 0 of 1
6. (load-truck pkg3 truck1 pos1_3)
   deleted: (at pkg3 pos1_3)
   added: (in pkg3 truck1)
   goals met: 1 of 1
